app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    session[:return_to] ||= request.url
    if params == {"action"=>"index", "controller"=>"movies"}
      redirect_to session[:return_to]
    end
    session[:return_to] = request.url
    @sort = params[:sort]
    @movies = []
    @all_ratings = ["G", "PG", "PG-13", "R", "NC-17"]
    if params[:ratings] == nil
      @movies = Movie.all